Саракташ2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Опт</name>
      <description>Опт</description>
    </items>
  </predefined>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьНаСайт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаНаличия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьЭтикетку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОптовыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварИзРеестраНХП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УменьшениеЦеныЗаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоставщики</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОптРазрезыЗначения</name>
    <attributes>
      <name>Разрез</name>
      <type>
        <types>EnumRef.ОптРазрезыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПохожиеРозничныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МастерицыДляПроверки</name>
    <attributes>
      <name>Мастерица</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Catalogs/Номенклатура/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда 
		ЗаполнитьСтрокуПоиска();
	КонецЕсли;
	
	Если ЭтоГруппа И Не Родитель = Справочники.Номенклатура.Опт И ОптРазрезыЗначения.Количество() > 0 Тогда 
		Отказ = Истина;
		Сообщить("Настройка разрезов доступна только для оптовых групп!", СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПоиска()
	
	СтрокаПоиска = "";
	СтрокаПоиска = ""+СокрЛП(Артикул)
	+СокрЛП(IDНаСайте)
	+СокрЛП(Строка(ЕдиницаИзмерения))
	+Формат(Код,"ЧГ=0")
	+Строка(ВидНоменклатуры);
	Для Каждого Стр Из ДополнительныеРеквизиты Цикл
		СтрокаПоиска = СтрокаПоиска + СокрЛП(Строка(Стр.Значение));
	КонецЦикла;							
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		//ЮРР 06.04.2017 9:39:41 Зарегистрировать в ПО
		Если Не ЭтоГруппа 
			И Не Родитель.Наименование = "Опт" 
			И ВыгружатьНаСайт Тогда
			
			Справочники.Номенклатура.ЗарегистрироватьВПО(Ссылка);			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
